rails/sample_app/app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "金"], ["body", "一億円"], ["created_at", "2020-06-02 13:37:18.120836"], ["updated_at", "2020-06-02 13:37:18.120836"]]
---
   def create
   # ストロングパラメーターを使用
     list = List.new(list_params)
    # DBへ保存する
     list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "一億円ほしい"], ["updated_at", "2020-06-03 14:23:14.360683"], ["id", 1]]
---
   def update
      list = List.find(params[:id])
      list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
   def destroy
      list = List.find(params[:id])
      list.destroy